nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt595/edgefast_bluetooth_examples/peripheral_ht/pin_mux.h
/*! @name FLEXSPI0_DATA1 (coord T14), U38[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA1_SIGNAL FLEXSPI_DATA1    /*!<@brief Signal name */
                                                                       /* @} */

/*! @name FLEXSPI0_DATA2 (coord R13), U38[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA2_SIGNAL FLEXSPI_DATA2    /*!<@brief Signal name */
                                                                       /* @} */

/*! @name FLEXSPI0_DATA3 (coord R12), U38[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA3_SIGNAL FLEXSPI_DATA3    /*!<@brief Signal name */
                                                                       /* @} */

/*! @name FLEXSPI0_DATA4 (coord N12), U38[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA4_SIGNAL FLEXSPI_DATA4    /*!<@brief Signal name */
                                                                       /* @} */

/*! @name FLEXSPI0_DATA5 (coord R14), U38[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA5_SIGNAL FLEXSPI_DATA5    /*!<@brief Signal name */
                                                                       /* @} */

/*! @name FLEXSPI0_DATA6 (coord P14), U38[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA6_SIGNAL FLEXSPI_DATA6    /*!<@brief Signal name */
                                                                       /* @} */

/*! @name FLEXSPI0_DATA7 (coord P13), U38[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DATA7_SIGNAL FLEXSPI_DATA7    /*!<@brief Signal name */
                                                                       /* @} */

/*! @name FLEXSPI0_SCLK (coord T17), U38[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_PERIPHERAL FLEXSPI0    /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_SCLK_SIGNAL FLEXSPI_SCLK    /*!<@brief Signal name */
                                                                     /* @} */

/*! @name FLEXSPI0_SS0_N (coord U16), U38[C2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_CS_PERIPHERAL FLEXSPI0     /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_CS_SIGNAL FLEXSPI_SS0_N    /*!<@brief Signal name */
                                                                    /* @} */

/*! @name FLEXSPI0_DQS (coord U14), U38[C3]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DQS_PERIPHERAL FLEXSPI0   /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_FLEXSPI0_DQS_SIGNAL FLEXSPI_DQS    /*!<@brief Signal name */
                                                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexSPI0BPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC7 0x07u            /*!<@brief Selects pin function 7 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO2_10 (coord N5), SD0_RESET_N
  @{ */
/* Routed pin properties */
#define BOARD_INITPINSM2_SD0_RESET_N_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINSM2_SD0_RESET_N_SIGNAL PIO2               /*!<@brief Signal name */
#define BOARD_INITPINSM2_SD0_RESET_N_CHANNEL 10                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINSM2_SD0_RESET_N_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINSM2_SD0_RESET_N_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINSM2_SD0_RESET_N_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINSM2_SD0_RESET_N_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINSM2_SD0_RESET_N_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO4_3 (coord M14), M2_3V3
  @{ */
/* Routed pin properties */
#define BOARD_INITPINSM2_M2_3V3_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITPINSM2_M2_3V3_SIGNAL PIO4                        /*!<@brief Signal name */
#define BOARD_INITPINSM2_M2_3V3_CHANNEL 3                          /*!<@brief Signal channel */

