nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt595/edgefast_bluetooth_examples/peripheral_ht/pin_mux.h
/*! @name PMIC_I2C_SDA (coord K6), U30[E5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPMICPINS_PMIC_I2C_SDA_PERIPHERAL FLEXCOMM15 /*!<@brief Peripheral name */
#define BOARD_INITPMICPINS_PMIC_I2C_SDA_SIGNAL SDA            /*!<@brief Signal name */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPmicPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name SD0_CLK (coord R5), U111A[M6]/SD0_CLK
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_CLK_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_CLK_SIGNAL USDHC_CLK          /*!<@brief Signal name */
                                                             /* @} */

/*! @name SD0_CMD (coord R6), U111A[M5]/SD0_CMD
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_CMD_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_CMD_SIGNAL USDHC_CMD          /*!<@brief Signal name */
                                                             /* @} */

/*! @name SD0_D0 (coord U4), U111A[A3]/SD0_D0
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_D0_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_D0_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_SD0_D0_CHANNEL 0                /*!<@brief Signal channel */
                                                           /* @} */

/*! @name SD0_D1 (coord T4), U111A[A4]/SD0_D1
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_D1_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_D1_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_SD0_D1_CHANNEL 1                /*!<@brief Signal channel */
                                                           /* @} */

/*! @name SD0_D2 (coord T7), U111A[A5]/SD0_D2
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_D2_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_D2_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_SD0_D2_CHANNEL 2                /*!<@brief Signal channel */
                                                           /* @} */

/*! @name SD0_D3 (coord U6), U111A[B2]/SD0_D3
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_D3_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_D3_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_SD0_D3_CHANNEL 3                /*!<@brief Signal channel */
                                                           /* @} */

/*! @name SD0_D4 (coord P5), U111A[B3]/SD0_D4
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_D4_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_D4_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_SD0_D4_CHANNEL 4                /*!<@brief Signal channel */
                                                           /* @} */

/*! @name SD0_D5 (coord R4), U111A[B4]/SD0_D5
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_D5_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_D5_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_SD0_D5_CHANNEL 5                /*!<@brief Signal channel */
                                                           /* @} */

/*! @name SD0_D6 (coord P4), U111A[B5]/SD0_D6
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_D6_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_D6_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_SD0_D6_CHANNEL 6                /*!<@brief Signal channel */
                                                           /* @} */

/*! @name SD0_D7 (coord T6), U111A[B6]/SD0_D7
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SD0_D7_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_D7_SIGNAL USDHC_DATA        /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_SD0_D7_CHANNEL 7                /*!<@brief Signal channel */
                                                           /* @} */

/*! @name SD0_CARD_DET_N (coord T3), J32[10]/SD0_CARD_DET_N
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITEMMCPINS_SD0_CARD_DET_N_PERIPHERAL USDHC0
/*!
 * @brief Signal name */
#define BOARD_INITEMMCPINS_SD0_CARD_DET_N_SIGNAL USDHC_CARD_DET
/* @} */

/*! @name PIO4_0 (coord N15), U117[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITEMMCPINS_SDC_3V3_PERIPHERAL GPIO          /*!<@brief Peripheral name */
#define BOARD_INITEMMCPINS_SDC_3V3_SIGNAL PIO4              /*!<@brief Signal name */
#define BOARD_INITEMMCPINS_SDC_3V3_CHANNEL 0                /*!<@brief Signal channel */

