nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt595/edgefast_bluetooth_examples/peripheral_ht/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITEMMCPINS_SDC_3V3_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITEMMCPINS_SDC_3V3_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITEMMCPINS_SDC_3V3_PORT 4U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEMMCPINS_SDC_3V3_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITEMMCPINS_SDC_3V3_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitEmmcPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC2 0x02u            /*!<@brief Selects pin function 2 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FLEXSPI1_SCLK (coord H2), U108[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_CLK_PERIPHERAL FLEXSPI1    /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_CLK_SIGNAL FLEXSPI_SCLK    /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI1_DATA0 (coord H1), U108[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ0_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ0_SIGNAL FLEXSPI_DATA0    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA1 (coord G2), U108[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ1_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ1_SIGNAL FLEXSPI_DATA1    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA2 (coord F1), U108[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ2_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ2_SIGNAL FLEXSPI_DATA2    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA3 (coord K3), U108[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ3_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ3_SIGNAL FLEXSPI_DATA3    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DQS (coord H3), U108[C3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_DQS_PERIPHERAL FLEXSPI1   /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_DQS_SIGNAL FLEXSPI_DQS    /*!<@brief Signal name */
                                                            /* @} */

/*! @name FLEXSPI1_SS0_N (coord E13), U108[A3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_CE_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_CE_SIGNAL FLEXSPI_SS0_N    /*!<@brief Signal name */
                                                             /* @} */

/*! @name FLEXSPI1_DATA4 (coord H5), U108[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ4_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ4_SIGNAL FLEXSPI_DATA4    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA5 (coord H4), U108[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ5_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ5_SIGNAL FLEXSPI_DATA5    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA6 (coord J3), U108[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ6_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ6_SIGNAL FLEXSPI_DATA6    /*!<@brief Signal name */
                                                               /* @} */

/*! @name FLEXSPI1_DATA7 (coord J4), U108[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ7_PERIPHERAL FLEXSPI1     /*!<@brief Peripheral name */
#define BOARD_INITPSRAMPINS_PSRAM_ADQ7_SIGNAL FLEXSPI_DATA7    /*!<@brief Signal name */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPsRamPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
